<template>
  <div id="info-container">
    <el-row style="height: 100%">
      <el-col :span="4">
        <el-affix :offset="60">
          <el-anchor :container="containerRef" direction="vertical" type="default" :offset="30" @click="handleClick">
            <el-anchor-link href="#part1" title="1. 研究区概况" />
            <el-anchor-link href="#part2" title="2. 时空动态分析" />
            <el-anchor-link href="#part3" title="3. 生态敏感性评价指标体系的构建" />
            <el-anchor-link href="#part4" title="4. 决策支持分析" />
          </el-anchor>
        </el-affix>
      </el-col>
      <el-col :span="20">
        <el-scrollbar>
          <el-affix :offset="60">
            <div ref="containerRef" style="height: 100%; overflow-y: auto">
              <div id="part1" style="margin-top: 30px; height: 100px">
                <p style="font-size: 24px; font-weight: bold; margin-bottom: 20px">1. 研究区概况</p>
                <p>
                  南京，简称宁，江苏省省会，是中国东部地区重要的中心城市、“一带一路”交汇点重要枢纽城市、长江经济带重要节点城市、长三角城市群特大城市及长三角辐射带动中西部地区发展重要门户城市。总面积6587平方公里，辖11个区和1个国家级江北新区，2022年末常住人口949.11万人。南京地区生产总值过去五年连续跨越五个千亿级台阶，2022年达1.69万亿元人民币，位列全国大中城市十强。
                  南京市位于中国东部、长江下游中部地区，其地理坐标为北纬31°14′～32°37′,东经118°22′～119°14′,其北朝江淮平原，东临长三角南面与安徽省相望，属亚热带季风气候，雨量充沛，四季分明，地形以低山丘陵为主。南京自然生态优美，浩浩长江穿城而过，巍巍钟山气象雄伟，十里秦淮蜿蜒流淌，梧桐大道绿树成荫，山水城林融为一体，城市中遍布绿地、公园、湿地、动植物园等生物多样性丰富的区域，建成区绿化覆盖率近45%，自然湿地保护率70.7%，森林覆盖面积297.1万顷，是国家生态园林城市、国家森林城市，生态环境质量位居长三角前列
                </p>
              </div>
              <div id="part2" style="margin-top: 30px; height: 400px">
                <p style="font-size: 24px; font-weight: bold; margin-bottom: 20px">2. 时空动态分析</p>
                2000 年至 2020
                年间南京市土地类型均发生了变化，如图可知，建筑用地、水体、林地面积均有所增加，耕地面积发生了减少，其中变化最大的是建筑用地面积，城市附近增加了大量的建筑用地，南京市中心向四周扩散成为城市扩张的主流趋势，同时绿地面积的减少引发担忧。
                <img src="@/assets/info/图1.1.png" style="height: 300px; display: block" />
              </div>
              <div id="part3" style="margin-top: 30px; height: 810px">
                <p style="font-size: 24px; font-weight: bold; margin-bottom: 20px">3. 生态敏感性评价指标体系的构建</p>
                <p>
                  3.1 评价因子选取与等级划分
                  依据生态学领域专家指导意见，参考生态敏感性相关论文中生态敏感性评价方法的指标选取，结合南京市当地生态环境情况的综合特征，完成南京市生态因子数据的筛选，所采用的分析评价南京市生态敏感性的主要指标包括坡向、坡度、高程、土地利用类型、植被覆盖度、水域缓冲区这6个生态因子，并对以上6个生态因子进行分级赋值。
                  采用适宜的评价标准定量化处理6个影响因子，将各因子分级并且一一对应赋值，即生态不敏感、轻度敏感、中度敏感、重度敏感和极度敏感，以上等级分别对应数值 1、3、5、7、9，具体分级标准如下：
                </p>
                <img src="@/assets/info/图2.1.png" style="height: 300px; display: block" alt="" />
                <p>
                  3.2层次分析法与评价因子权重确定
                  1)建立递阶层次结构，梳理研究问题将其条理化并且分解为不同的因素，根据各因素之间相互作用和影响程度将各因素分为不同类型，归纳为目标层、准则层和方案层，构造出一个有层次的结构模型。
                  2)生成因子判断矩阵表，根据层次权重决策分析的方法，参考多位学者的研究结果询问相关意见，结合南京市当地的生态环境的状况，采用两两对比单因子之间对于生态环境的相对重要程度，并根据构建如下表所示的判断矩阵，并得出各因子的权重值。
                </p>
                <img src="@/assets/info/图3.1.png" style="height: 300px; display: block" alt="" />
                <p>
                  3)层次单排序计算，计算判断矩阵的最大特征值以及其相应的特征向量。
                  4)一致性检验，由一致性检验判定以上6*6判断矩阵是否具备合理性，经演算得出：CR=0.0847<0.1。说明该生态因子权重判断能够被运用于研究，最后确定出单因子重要性的权重值。 3.3 空间叠加分析
                  利用数学模型对6个单因子生态敏感性图层进行空间加权叠加，计算出生态敏感性综合得分，并获得综合生态敏感性图。生态敏感性数学模型见公式(1)。
                </p>

                <img src="@/assets/info/图4.png" alt="" />
              </div>
              <div id="part4" style="margin-top: 30px; height: 300px">
                <p style="font-size: 24px; font-weight: bold; margin-bottom: 20px">4. 决策支持分析</p>
                <p>
                  综合各生态因子的敏感性分析图，在GIS中进行加权叠加分析后，得出南京市生态敏感性综合分析图，其生态敏感性多集中在低敏感和中度敏感内，南京市整体生态敏感性偏中低等，极度敏感性分区占总面积的8.33%，高度敏感占比
                  17.10%,中度敏感占比30.84%，不敏感区和低度敏感区占比14.82%和28.92%。
                </p>

                <img src="@/assets/info/图5.png" style="height: 600px; display: block" alt="" />
                <p>
                  从空间分布上看，敏感性强的地区（极度敏感区和高度敏感区)主要分布在南京市的长江，玄武湖，莫愁湖，石白湖，固城湖等大型湖泊河流周边附近。中度敏感区主要位于六合区中北部、溧水区以及高淳区东北部一带，不敏感区域和轻度敏感区域则主要分布在南京市的主城区秦淮区、鼓楼区、玄武区、建邺区、栖霞区、雨花台区以及江宁区西北部一带。
                  南京市作为一座历史悠久的文化名城，其综合生态敏感性受到多种因素的影响。高敏感区主要集中在长江等大型湖泊河流的附近，这一现象背后蕴含着深刻的地理和社会经济原因。从地理方面来看，南京市地处长江下游，拥有众多大型湖泊和河流，这些水域是城市生态系统中不可或缺的重要组成部分。然而，也正是由于这些水域的存在，使得南京市的生态环境容易受到外界干扰和破坏。例如，长江的水位、流量、水质等变化都会直接影响到南京市的生态稳定性。而长江等大型湖泊河流的附近往往分布着湿地、沼泽等自然生态系统。这些生态系统具有高度的生态敏感性，对外部干扰的抵抗力较弱。一旦受到污染或破坏，很难恢复到原始状态。南京市的地形地貌也增加了其生态敏感性，南京市地势较为平坦，水系发达，地下水与地表水交互作用频繁。这种地理特点使得南京市的生态环境容易受到水污染和土壤污染的影响。
                  从社会经济方面来看，南京市作为一座现代化大都市，人口密集，工业发达，城市化进程快速。这些社会经济活动对生态环境产生了巨大的压力。长江等大型湖泊河流附近的区域往往是城市发展的重要区域，这些区域承受着高强度的开发和利用压力。工业排放、城市污水、农业面源污染等问题日益严重，对生态环境造成了严重破坏。同时随着城市化进程的加速，南京市的人口持续增长，城市规模不断扩大。这种趋势导致了对自然资源的过度开发和利用，也会进一步加剧了生态敏感区的压力。
                  随着近几年国家对环境的深度重视，南京也在积极响应号召，持续推动发展方式绿色转型，万元GDP能耗下降18.7%，2018年以来累计完成矿山修复10.3平方公里。长江南京段生态岸线占比达80.3%，生物多样性改善成效明显，大部分地区属于中低敏感地区。
                  但是南京市水域附近的生态环境仍然需要持续改进，这里我们可以采取一些有效措施。一方面，加强生态环境保护意识，提高公众对生态环境保护的认识和重视程度；另一方面，制定科学合理的生态保护和修复措施，加强对生态敏感区的保护和管理；同时，还需要优化城市产业结构，推动绿色发展和可持续发展，减轻对生态环境的压力。只有这样，才能实现南京市生态环境的可持续发展，为城市的繁荣和人民的福祉创造更好的条件。
                </p>
              </div>
            </div>
          </el-affix>
        </el-scrollbar>
      </el-col>
    </el-row>
  </div>
</template>

<script setup lang="ts">
import { ref } from 'vue';
const count = ref(3);

const add = () => {
  count.value++;
};
const onDelete = () => {
  if (count.value > 0) {
    count.value--;
  }
};
const containerRef = ref<HTMLElement | null>(null);
// containerRef.value = document.getElementById('info-container');
const handleClick = (e: MouseEvent) => {
  e.preventDefault();
};
</script>
<style lang="scss" scoped>
#info-container {
  width: 100%;
  height: 100%;
}
</style>
